CHAT_GPT_MENU_MESSAGE = '''
🤖 Что вы хотите узнать у ChatGPT? Просто отправте сообщение с вопросом и бот даст вам ответ.
'''
CONFIRM_CHAT_GPT_CLEAR_HISTORY_MESSAGE = '''
❓ Вы действительно хотите выполнить это действие?

❗ После этого вся история вашего диалога с ChatGPT будет удалена (не сообщения). 
'''
START_CHAT_GPT_WORK_MESSAGE = '⏳ Генерирую ответ...'
EMPTY_CHAT_GPT_HISTORY_MESSAGE = '''
❗ Ваш диалог с ChatGPT уже пуст. 

Напишите какое-либо сообщение, чтобы воспользоваться данной функцией.
'''
SUCCESSFUL_CHAT_GPT_CLEAR_HISTORY_MESSAGE = '''
🗑️ Я удалил историю вашего диалога с ChatGPT, теперь вы можем начать его с начала.
'''
LIMIT_CHAT_GPT_HISTORY_LENGTH_MESSAGE = '''
❗ Вы привысили лимит в {} сообщений. История вашего диалога с ChatGPT была автоматически удалена.
'''
LIMIT_CHAT_GPT_MAX_CONTENT_LENGTH_MESSAGE = '''
️❗ Длина вашего сообщения превышает допустимое значение в {} символов.
'''
CHAT_GPT_ERROR_MESSAGE = '''
️❗ Похоже, что Chat GPT не смог дать ответ на ваш запрос, возможно это связано с проблемой получения ответа от сервера OpenAI или же вы слишком рано вышли из меню ChatGPT.
'''
