MAIN_MENU_MESSAGE = '🤖 Выберите режим'
ASU_BUILDINGS_LOCATION_MESSAGE = '''
Корпус «М» - <a href="https://yandex.ru/maps/org/altayskiy_gosudarstvenny_universitet/79582866169/?ll=
83.774817%2C53.347715&z=17" title="корпус"><b>пр-т Ленина, 61A</b></a>.

Корпус «Л» - <a href="https://yandex.ru/maps/197/barnaul/house/prospekt_lenina_61/bEoYcQBmSEUFQFtpfX91dnlkZA==/?ll=
83.776102%2C53.347570&z=17.1" title="корпус"><b>пр-т Ленина, 61</b></a>.

Корпус «Д» - <a href="https://yandex.ru/maps/197/barnaul/house/ulitsa_dimitrova_66/bEoYcQBmS0wOQFtpfX91dXRlYg==
/?ll=83.776299%2C53.344866&z=17.1" title="корпус"><b>ул. Димитрова, 66</b></a>.

Корпус «С» - <a href="https://yandex.ru/maps/197/barnaul/house/sotsialisticheskiy_prospekt_68/bEoYcQBoSEYFQFtpfX
91c31rbA==/?ll=83.778132%2C53.342188&z=17.1" title="корпус"><b>пр-т Социалистический, 68</b></a>.

Корпус «К» - <a href="https://yandex.ru/maps/197/barnaul/house/krasnoarmeyskiy_prospekt_90/bEoYcQBhTEUFQFtpfX91c
3RiYw==/?ll=83.771502%2C53.342817&z=17.1" title="корпус"><b>пр-т Красноармейский, 90</b></a>.

Корпус «А» - <a href="https://yandex.ru/maps/197/barnaul/house/ulitsa_anatoliya_122/bEoYcQBoTkAFQFtpfX9ycn5jYA
==/?indoorLevel=1&ll=83.778752%2C53.333204&z=17" title="корпус"><b>ул. Анатолия, 122</b></a>.

Корпус «Я» - <a href="https://yandex.ru/maps/197/barnaul/house/ulitsa_yarnykh_49/bEoYcQJnSEIDQFtpfX93eHVlbQ
==/inside/?ll=83.757257%2C53.369932&tab=inside&z=17.8" title="корпус"><b>ул. Ярных, 49</b></a>.

Корпус «Э» - <a href="https://yandex.ru/maps/197/barnaul/house/ulitsa_emilii_alekseyevoy_6/bEoYcQRiQUwEQFtpfX
95cXRmYw==/?ll=83.732893%2C53.380858&z=17.1" title="корпус"><b>ул. Эмилии Алексеевой, 6</b></a>.

Корпус «Кс» - <a href="https://yandex.ru/maps/org/kolledzh_altayskogo_gosudarstvennogo_universiteta/1764
925544/?ll=83.788130%2C53.345903&z=17.04" title="корпус"><b>пр-т Комсомольский, 100/49</b></a>.

Спортивно-оздоровительный комплекс - <a href="https://yandex.ru/maps/197/barnaul/house/krasnoarmeyskiy_prospekt_90a
/bEoYcQBgQEwOQFtpfX91c3hqYQ==/?ll=83.771000%2C53.342495&z=17.1" title="корпус"><b>пр-т Красноармейский, 90А</b></a>.

Лыжная база - <a href="https://yandex.ru/maps/org/lyzhnaya_baza_altgu/1206451800/?ll=83.759788%2C53.307111&z=17.04" 
title="корпус"><b>ул. Ляпидевского, 6А</b></a>.
'''
HELP_MESSAGE = '''
🤖 Я обладаю следующим функционалом:

📌 Поиск расписания групп или преподавателей АлтГУ.
Выбери в главном меню расписание, которое ты хочешь узнать, а после введи номер интересующей тебя группы или фамилию преподавателя <u>(можно не полностью)</u>.

📌 Распознование голоса.
Ты можешь отправить мне голосовое сообщение с номером группы или фамилией преподавателя, а я постараюсь предоставить тебе необходимую информацию.

❗ Обрати внимание, что при поиске расписания для преподавателя важно назвать его фамилию, а при поиске расписания для студентов необходимо проговаривать символы ' . ' и ' - ' как точку и тире соответственно.

📌 Местоположение корпусов АлтГУ.
Я могу предоставить тебе информацию о местоположении корпусов АлтГУ. Для этого нажми на соответствующую кнопку в главном меню и выбери нужный корпус. Затем ты сможешь перейти в Яндекс Карты и построить маршрут.

📌 ChatGPT.
Также в меня встроен умный чат-бот помощник ChatGPT 3.5 turbo. Ты можешь воспользоваться им, выбрав соответствующую опцию в главном меню. ChatGPT также поддерживает распознование голоса.

😊 Надеюсь, что я смог тебе помочь.
'''
