ENTER_LECTURER_MESSAGE = '✏ Введите преподавателя.'
PICK_LECTURER_MENU_MESSAGE = '🤖 Выберите интересующего преподавателя'
ERROR_FIND_LECTURER_MESSAGE = '''
🤖 К сожалению, я не смог получить доступ к указанному вами преподавателю.

❗ Пожалуйста, проверьте ваш запрос на корректность и повторите его.

🚀 <a href="{}" title="расписание"><b>Расписание занятий АлтГУ</b></a>
'''
ERROR_MAX_INLINE_KEYBOARD_LENGTH_LECTURER_MESSAGE = '''
🤖 Я нашёл больше преподавателей, чем могу отобразить в этом сообщении.

❗ Пожалуйста, напишите более конкретное ФИО преподавателя и попробуйте еще раз.

🚀 <a href="{}" title="расписание"><b>Расписание занятий АлтГУ</b></a>
'''
ERROR_LECTURER_WEEKLY_SCHEDULE_MESSAGE = '''
🤖 К сожалению, я не смог получить доступ к недельному расписанию указанного вами преподавателя.

🚀 <a href="{}" title="расписание"><b>Расписание занятий АлтГУ</b></a>
'''
