# STUDENT SCHEDULE.
NO_CLASSES_TODAY_STUDENT_MESSAGE = '''
🤖 Похоже у указанной вами группы <b>сегодня</b> нет пар.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
NO_CLASSES_TOMORROW_STUDENT_MESSAGE = '''
🤖 Похоже у указанной вами группы <b>завтра</b> нет пар.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
NO_CLASSES_CALENDAR_STUDENT_MESSAGE = '''
🤖 Похоже у указанной вами группы <b>{}</b> нет пар или они ещё не появились на сайте АлтГУ.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
NO_CLASSES_WEEKLY_STUDENT_MESSAGE = '''
🤖 похоже у указанной вами группы <b>на этой неделе</b> нет пар.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
# LECTURER SCHEDULE.
NO_CLASSES_TODAY_LECTURER_MESSAGE = '''
🤖 Похоже у указанного вами преподавателя <b>сегодня</b> нет пар.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
NO_CLASSES_TOMORROW_LECTURER_MESSAGE = '''
🤖 Похоже у указанного вами преподавателя <b>завтра</b> нет пар.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
NO_CLASSES_CALENDAR_LECTURER_MESSAGE = '''
🤖 Похоже у указанного вами преподавателя <b>{}</b> нет пар или они ещё не появились на сайте АлтГУ.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
NO_CLASSES_WEEKLY_LECTURER_MESSAGE = '''
🤖 похоже у указанного вами преподавателя <b>на этой неделе</b> нет пар.

🚀 <a href="{}" title="расписание"><b>Недельное расписание АлтГУ</b></a>
'''
