VIEW_REVIEWS_MENU_MESSAGE = '''
🤖 Выберите режим просмотра отзывов.

❗ Отзывов доступно: <b>{}</b> .
'''
CONFIRM_DELETE_REVIEW_MENU_MESSAGE = '❓ Вы действительно хотите удалить этот отзыв?'
SUCCESSFUL_DELETE_REVIEW_MESSAGE = '🗑️ Отзыв успешно удалён.'
NOT_FOUND_REVIEWS_MESSAGE = '❗ У вас больше нет доступных для просмотра отзывов.'
ERROR_VIEW_ALL_REVIEWS_MESSAGE = '❗ У вас нет доступных для просмотра отзывов.'
ENTER_LIMIT_VIEW_REVIEWS_MESSAGE = '✏️ Введите количество отзывов для просмотра.'
ERROR_ENTER_LIMIT_VIEW_REVIEWS_MESSAGE = '''
❗ Вы ввели некорректное количество отзывов.

Пожалуйста убедитесь, что введённое количество отзывов является целым число, которое <b>больше 0 и не превышает {}</b>.
'''
