ENTER_STUDENT_MESSAGE = '✏ Введите номер группы.'
PICK_STUDENT_MENU_MESSAGE = '🤖 Выберите интересующую группу'
ERROR_FIND_STUDENT_MESSAGE = '''
🤖 К сожалению, я не смог получить доступ к указанной вами группе.

❗ Пожалуйста, проверьте ваш запрос на корректность и повторите его.

🚀 <a href="{}" title="расписание"><b>Расписание занятий АлтГУ</b></a>
'''
ERROR_MAX_INLINE_KEYBOARD_LENGTH_STUDENT_MESSAGE = '''
🤖 Я нашёл больше групп, чем могу отобразить в этом сообщении.
 
❗ Пожалуйста, напишите более конкретное название группы и попробуйте еще раз.

🚀 <a href="{}" title="расписание"><b>Расписание занятий АлтГУ</b></a>
'''
ERROR_STUDENT_WEEKLY_SCHEDULE_MESSAGE = '''
🤖 К сожалению, я не смог получить доступ к недельному расписанию указанной вами группы.

🚀 <a href="{}" title="расписание"><b>Расписание занятий АлтГУ</b></a>
'''
